#### HemisphericalLightDistribution Members

---

|  |
| --- |
| HemisphericalLightDistribution Class   Constructors   Methods   Properties   See Also |

The  HemisphericalLightDistribution  type exposes the following members.

# Constructors

|  | Name | Description |
| --- | --- | --- |
| Public method | HemisphericalLightDistribution | Creates a hemispherical light distribution object. |
| Public method | HemisphericalLightDistribution(HemisphericalLightDistribution) | Creates a copy of the given hemispherical light distribution |

# Methods

|  | Name | Description |
| --- | --- | --- |
| Public method | Clone | Creates a copy of the LightDistribution derived object. (Inherited from  LightDistribution  .) |
| Public method | Dispose | (Inherited from  LightDistribution  .) |
| Public method | Equals | Determines whether the specified  Object  is equal to the current  Object  . (Inherited from  Object  .) |
| Public method | GetHashCode | Serves as a hash function for a particular type. (Inherited from  Object  .) |
| Public method | GetType | Gets the  Type  of the current instance. (Inherited from  Object  .) |
| Public method | ToString | Returns a string that represents the current object. (Inherited from  Object  .) |

# Properties

|  | Name | Description |
| --- | --- | --- |
| Public property | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. (Inherited from  LightDistribution  .) |

# See Also

HemisphericalLightDistribution Class

Autodesk.Revit.DB.Lighting Namespace